Revit 2026 API

# PointCloudFilterFactoryCreateMultiPlaneFilter(IListPlane, Int32) Method

---
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static PointCloudFilter CreateMultiPlaneFilter(
	IList<Plane> planes,
	int exactPlaneCount
)
```
```vb
Public Shared Function CreateMultiPlaneFilter (
	planes As IList(Of Plane),
	exactPlaneCount As Integer
) As PointCloudFilter
```
```cpp
public:
static PointCloudFilter^ CreateMultiPlaneFilter(
	IList<Plane^>^ planes,
	int exactPlaneCount
)
```
```fsharp
static member CreateMultiPlaneFilter :
        planes : IList<Plane> *
        exactPlaneCount : int -> PointCloudFilter
```

#### Parameters

planes IListPlane

exactPlaneCount Int32

#### Return Value

PointCloudFilter

#### Reference

PointCloudFilterFactory Class

CreateMultiPlaneFilter Overload

Autodesk.Revit.DB.PointClouds Namespace